<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"22ab9bd0c2e56bc3f237d5f2485d0d961a3628207b9a86d38bf2241ea5ca7e94","plan_job_ref":"Job Run Terraform plan in staging #255 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14894278611","plan_out_hash":"f2c3922681a751bc9a475ca5f888ddbda64ac0038b210ecf1b528433c1bb1465","plan_hash":"304d93079c7c6a4783d0da06adb86bfae88900ae6b10ecb9e35706c9779f2573","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous_monitoring-staging.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "sC3KxKKJHGtmIsJ86XFIZ/z3VAMcCSqPvmTxJ0Ay+bU=" -> "vMSLn2qR+aTHm3taK0p54N64rmp1GZC2kBUIaVOoT30="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-06T18:01:05Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "af32b47f-3068-43a9-b31a-498745b66b7f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "6a4244b6-9b21-4eba-ad87-4b324d5d984e"
!~      updated_at   = "2025-05-05T21:46:17Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-05-05T21:38:13Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b" -> "6d159fa93795c4fe16414e205b5608b82ce16f2b39845c1e225a231a1c5f7c60"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-05T21:38:25Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> null
-               app_process_type = "web" -> null
-               id               = "24e55155-3a81-429b-a2ad-59871ea0380e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "aed0ad06-a525-4ad1-9cbd-87f9d735dbb9"
!~      updated_at   = "2025-05-05T21:38:26Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #255](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14894278611)